"""4. Реалізуйте генератор, який приймає на
вхід будь-яку ітерабельну послідовність
(рядок, список, кортеж) і повертає генератор,
який буде повертати значення з цієї послідовності,
при цьому, якщо було повернено останній елемент із
послідовності - ітерація починається знову.
   Приклад (якщо запустили його у себе - натисніть Ctrl+C ;) ):
   for elem in my_generator([1, 2, 3]):
       print(elem)
   ......."""


def my_gen(iterable):
    while True:
        for i in iterable:
            yield i


for elem in my_gen([1, 2, 3]):
    print(elem)
