"""7. Напишіть функцію, яка приймає 2 списки.
Результатом має бути новий список, в якому
знаходяться елементи першого списку, яких немає в
другому. Порядок елементів, що залишилися має
відповідати порядку в першому (оригінальному) списку.
Реалізуйте обчислення за допомогою генератора в один рядок.
    Приклад:
    array_diff([1, 2], [1]) --> [2]
    array_diff([1, 2, 2, 2, 3, 4], [2]) --> [1, 3, 4]"""


def array_diff(array1, array2):
    result = [item for item in array1 if item not in array2]
    return result


print(array_diff([1, 2, 2, 2, 3, 4], [2]))
