"""2. Написати функцію, яка приймає два параметри: ім'я
(шлях) файлу та кількість символів. Файл також додайте в
репозиторій. На екран має бути виведений список із трьома
блоками - символи з початку, із середини та з кінця файлу.
Кількість символів в блоках - та, яка введена в другому параметрі.
Придумайте самі, як обробляти помилку, наприклад, коли кількість
символів більша, ніж є в файлі або, наприклад, файл із двох
символів і треба вивести по одному символу, то що виводити на
місці середнього блоку символів?). Не забудьте додати
перевірку чи файл існує."""


def first_center_end(name, amount):
    try:
        if amount < 0:
            print('Число не може бути від\'ємним ')
            return
    except TypeError:
        print('Некоректні дані')
        return

    try:
        with open(name, 'r') as file:
            f = file.read()
            if len(f) < amount or len(f) - amount == 1:
                print('Занадто мало символів у файлі')
                return
    except FileNotFoundError:
        print('No such file')
    else:
        center = int(len(f) / 2) - int(amount / 2)
        b1 = f[0:amount]
        b2 = f[center:center + amount]
        b3 = f[-amount:]
        print([b1, b2, b3])


first_center_end('file.txt', 2)
